soap-wsdl/src/test/resources/WsdlRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <AccountDetailsRequest xmlns="http://com/blog/samples/webservices/accountservice">
            <accountNumber>xxx</accountNumber>
        </AccountDetailsRequest>
    </soap:Body>
</soap:Envelope>
